In [51]:
import pandas as pd

In [52]:
import pymysql
pymysql.install_as_MySQLdb()

In [53]:
pip install sqlalchemy-utils

Requirement already satisfied: sqlalchemy-utils in c:\users\jeancarlo garcia\anaconda3\lib\site-packages (0.38.2)
Requirement already satisfied: SQLAlchemy>=1.0 in c:\users\jeancarlo garcia\anaconda3\lib\site-packages (from sqlalchemy-utils) (1.4.22)
Requirement already satisfied: six in c:\users\jeancarlo garcia\anaconda3\lib\site-packages (from sqlalchemy-utils) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\jeancarlo garcia\anaconda3\lib\site-packages (from SQLAlchemy>=1.0->sqlalchemy-utils) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

## Creating the Database

In [57]:
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/booksCore"

In [58]:
# make the connection between python and MySQL, create an engine using the connection string just defined

create_database(connection_str)

Confirming database exists

In [59]:
database_exists(connection_str)

True

In [60]:
#To make the connection between python and MySQL, you will create an engine using the connection string you just defined.


engine = create_engine(connection_str)

In [61]:
engine

Engine(mysql+pymysql://root:***@localhost/booksCore)

## User dataframe converted to SQL table

In [62]:
df_users = pd.read_csv('data/users.csv')
df_user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [63]:
df_user.to_sql('users', engine, if_exists = 'replace')

## Title dataframe converted to SQL table

In [64]:
df_books = pd.read_csv('data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [65]:
df_books.to_sql('books', engine, if_exists = 'replace')

## Author dataframe converted to SQL table

In [66]:
df_author = pd.read_csv('data/authors.csv')
df_author.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [67]:
df_author.to_sql('authors', engine, if_exists = 'replace')

## Book ID dataframe converted to SQL table

In [68]:
df_bookId = pd.read_csv('data/favorites.csv')
df_bookId.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [69]:
df_bookId.to_sql('favorites', engine, if_exists = 'replace')

## Confirm SQL table creation

In [70]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_bookscore
0             authors
1               books
2           favorites
3               users

## Testing Database

In [ ]:
bb = """
SELECT 
    books.title, favorites.user_id
FROM 
    books
JOIN 
    favorites ON books.id = favorites.book_id
WHERE 
    favorites.user_id = 
        (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
    
;"""


pd.read_sql(bb, engine)